In [58]:
import pandas as pd
import numpy as np

In [59]:
dict = {'Product' : ['Apple', 'Cauliflower', 'Cherry', 'Cherry','Beans', 'Orange', 'Cauliflower', 'Cherry'],
 'Category' : ['Fruit', 'Vegetable', 'Fruit', 'Fruit','Vegetable', 'Fruit', 'Vegetable', 'Fruit'],
 'Quantity' : [6, 8, 4, 5, 4, 10, 8, 12],
 'Amount' : [300, 210, 550, 384, 630, 610, 60, 88]}

In [60]:
df = pd.DataFrame(dict)

In [61]:
df

       Product   Category  Quantity  Amount
0        Apple      Fruit         6     300
1  Cauliflower  Vegetable         8     210
2       Cherry      Fruit         4     550
3       Cherry      Fruit         5     384
4        Beans  Vegetable         4     630
5       Orange      Fruit        10     610
6  Cauliflower  Vegetable         8      60
7       Cherry      Fruit        12      88

# Total Sales of each food product

In [62]:
df.groupby('Product').Amount.sum().to_frame()

             Amount
Product
Apple           300
Beans           630
Cauliflower     270
Cherry         1022
Orange          610

# Total number of each products bought

In [63]:
df.groupby('Product').Quantity.sum().to_frame()

             Quantity
Product
Apple               6
Beans               4
Cauliflower        16
Cherry             21
Orange             10

# Total number of each product bought

In [64]:
df.groupby('Category').Quantity.sum().to_frame()

           Quantity
Category
Fruit            37
Vegetable        20

# Total sales of each food category

In [65]:
df.groupby('Category').Amount.sum().to_frame()

           Amount
Category
Fruit        1932
Vegetable     900

# Mean,median,mode of Sales of each food Category

In [66]:
df.groupby('Category').Amount.agg(['mean','median','min'])

            mean  median  min
Category
Fruit      386.4   384.0   88
Vegetable  300.0   210.0   60

# Mean,median,mode of Sales of each food item

In [67]:
df.groupby('Product').Amount.agg(['mean','median','min'])

                   mean  median  min
Product
Apple        300.000000   300.0  300
Beans        630.000000   630.0  630
Cauliflower  135.000000   135.0   60
Cherry       340.666667   384.0   88
Orange       610.000000   610.0  610